In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [17]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [21]:
#this does not occur in place
#needs to write into the dataframe unless specifying "inplace=True"
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.drop('E',inplace=True)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [25]:
df.shape

(4, 5)

In [29]:
#df.loc returns a series using label indexing
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [31]:
df.loc['B','Y']

-0.8480769834036315

In [33]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [30]:
#df.iloc for numerical based index
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [35]:
booldf=df>0
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False

In [36]:
df[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN

In [37]:
df['W']>0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [43]:
#output of filtering is a dataframe
resultdf=df[df['W']>0]
resultdf

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [42]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [46]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [48]:
df[(df['W']>0) & (df['Y']>0)]

         W         X         Y         Z       new
A  2.70685  0.628133  0.907969  0.503826  3.614819

In [49]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [50]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [57]:
newinx = 'CA NY WY OR'.split()
newinx

['CA', 'NY', 'WY', 'OR']

In [55]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [58]:
df['States']=newinx

In [61]:
df.set_index('States')

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.614819
NY      0.651118 -0.319318 -0.848077  0.605965 -0.196959
WY     -2.018168  0.740122  0.528813 -0.589001 -1.489355
OR      0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [63]:
outside='G1 G1 G1 G2 G2 G2'.split()
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
#You get the Multiindex of different levels
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
#Construct a Multi index level dataframe
#index hierarchy
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [71]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [70]:
df.index.names = ['Groups','Num']

In [73]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [75]:
#xs grab a cross sectional data
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

##  Pandas - Missing Data

In [77]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)

In [78]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
#drop any column with a NAN value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [81]:
#threshold: at least n NA values for the row /column to be deleted
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [83]:
#fill in the missing values
df.fillna(value='FILL VALUE')
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group by allows you to group by a column and perform some aggregation

In [85]:
data={'Company':'GOOG GOOG MSFT MSFT FB FB'.split(),'Person':'Sam Charlie Amy Vanessa Carl Sarah'.split(),'Sales':[200,120,340,124,243,350]}

In [89]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
byComp=df.groupby('Company')
#After groupby, you will get a groupby object
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [93]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [94]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [95]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [96]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [97]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging, Joining and Concatanating

In [100]:
df1=pd.DataFrame({'A':'A0 A1 A2 A3'.split(),
                'B':'B0 B1 B2 B3'.split(),
                  'C':'C0 C1 C2 C3'.split(),
                  'D':'D0 D1 D2 D3'.split()})

In [109]:
df2=pd.DataFrame({'A':'A4 A5 A6 A7'.split(),
                'B':'B4 B5 B6 B7'.split(),
                  'C':'C4 C5 C6 C7'.split(),
                  'D':'D4 D5 D6 D7'.split()},
                index=[5,6,7,8])

In [110]:
df3=pd.DataFrame({'A':'A8 A9 A10 A11'.split(),
                'B':'B8 B9 B10 B11'.split(),
                  'C':'C8 C9 C10 C11'.split(),
                  'D':'D8 D9 D10 D11'.split()},
                index=[9,10,11,12])

In [103]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [104]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [106]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

#### Concatenation

Concatenation basically glues together DataFrames

In [112]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
5    A4   B4   C4   D4
6    A5   B5   C5   D5
7    A6   B6   C6   D6
8    A7   B7   C7   D7
9    A8   B8   C8   D8
10   A9   B9   C9   D9
11  A10  B10  C10  D10
12  A11  B11  C11  D11

In [111]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [118]:
left=pd.DataFrame({'A':'A0 A1 A2 A3'.split(),
                'B':'B0 B1 B2 B3'.split(),
                  'key':'K0 K1 K2 K3'.split()})
right=pd.DataFrame({
                'C':'C0 C1 C2 C3'.split(),
                  'D':'D0 D1 D2 D3'.split(),'key':'K0 K1 K2 K3'.split()})

In [119]:
pd.merge(left,right,how="inner",on="key")

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [120]:
pd.merge(left,right,how="left",on="key")

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

### Joining
Joining is a convenience method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame. It is the same as merge except it is joining on the index

In [126]:
left=pd.DataFrame({'A':'A0 A1 A2 A3'.split(),
                'B':'B0 B1 B2 B3'.split()},
                  index='K0 K1 K2 K3'.split())
right=pd.DataFrame({
                'C':'C0 C2 C3 C4'.split(),
                  'D':'D0 D2 D3 D4'.split()},
                    index='K0 K2 K3 K4'.split())

In [128]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [129]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3   C3   D3
K4  NaN  NaN   C4   D4

## Pandas Operations

In [160]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abs','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abs
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [133]:
df['col2'].unique()
df['col2'].nunique()

3

In [134]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [136]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [139]:
# apply: apply the function to the data frame
def times2(x):
    return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [141]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [146]:
df.drop('col1',axis=1)

   col2 col3
0   444  abs
1   555  def
2   666  ghi
3   444  xyz

In [147]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [148]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [157]:
#note that the index sticks with the data after sorting
df.sort_values('col2')

   col1  col2  col3  foo1_results  foo2_results  foo3_results
1     0    -2    -3             0             0             0
0     1     2    13             1             3             2
2    12     9     3             1            21            12

In [158]:
df.isnull()

    col1   col2   col3  foo1_results  foo2_results  foo3_results
0  False  False  False         False         False         False
1  False  False  False         False         False         False
2  False  False  False         False         False         False

In [164]:
df=pd.DataFrame({'A':'foo foo foo bar bar bar'.split(),
   'B':'one one two two one one'.split(),
   'C':'x y x y x y'.split(),
   'D':[1,3,2,5,4,1]})
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Custom function and apply

In [153]:

df = pd.DataFrame([[1,2,13],[0,-2,-3],[12,9,3]], columns=['col1','col2','col3'])
df
# if any numbers across the rows are zero, return(0), else 1.
def foo1(row):
    if (row.col1<0) or (row.col2<0) or (row.col3<0):
        return(0)
    else: return(1)

In [154]:
df['foo1_results'] = df.apply(lambda row: foo1(row) ,axis=1)    
df

   col1  col2  col3  foo1_results
0     1     2    13             1
1     0    -2    -3             0
2    12     9     3             1

In [155]:
df['foo2_results'] = df.apply(lambda row: (row.col1 + row.col2) if row.col3>=0 else 0 ,axis=1)
df

   col1  col2  col3  foo1_results  foo2_results
0     1     2    13             1             3
1     0    -2    -3             0             0
2    12     9     3             1            21

In [156]:
df['foo3_results'] = df.apply(lambda row: max(row.col1,row.col2) if row.col3>=0 else 0 ,axis=1)
df

   col1  col2  col3  foo1_results  foo2_results  foo3_results
0     1     2    13             1             3             2
1     0    -2    -3             0             0             0
2    12     9     3             1            21            12

## Data Input and Output

In [166]:
import pandas as pd
import sqlalchemy
import lxml
import html5lib
import BeautifulSoup4

Requirement already satisfied: lxml in c:\users\hehe\appdata\local\continuum\anaconda3\lib\site-packages (4.4.1)

In [169]:
pwd

'C:\\Users\\hehe\\OneDrive - EY\\Documents\\Python'

In [170]:
conda install xlrd

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\hehe\AppData\Local\Continuum\anaconda3

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.8.3                |           py37_0         2.8 MB
    ------------------------------------------------------------
                                           Total:         2.8 MB

The following packages will be UPDATED:

  conda                                       4.7.12-py37_0 --> 4.8.3-py37_0



Downloading and Extracting Packages

conda-4.8.3          | 2.8 MB    |            |   0%
conda-4.8.3          | 2.8 MB    |            |   1%
conda-4.8.3          | 2.8 MB    | #6         |  16%
conda-4.8.3          | 2.8 MB    | ##9        |  30%
conda-4.8.3          | 2.8 MB    | ####       |  41%
conda-4.8.3          | 2.8 MB    | #######2   |  73%
conda-4.8.3          | 2.8 MB    | #########2 |  93%
conda-4.8.3          | 2.8 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [171]:
data=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [175]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"